Problématique et/ou enjeux   
Sources
Alimentation des données
Intégration
Test (unitaire) 
Analyse et traitement des données     
Création de nouvelles variables (KPI)

Outil de restitution final (démo)  
Conclusion

## Bibliothèques python

In [11]:
import pandas as pd
import kagglehub
import numpy as np
import seaborn as sns

In [2]:
import kagglehub

# Download latest version
path = kagglehub.dataset_download("arnabchaki/data-science-salaries-2023")


print("Path to dataset files:", path)

Downloading to C:\Users\e2203451\.cache\kagglehub\datasets\arnabchaki\data-science-salaries-2023\1.archive...

100%|██████████| 25.4k/25.4k [00:00<00:00, 13.0MB/s]

Extracting files...
Path to dataset files: C:\Users\e2203451\.cache\kagglehub\datasets\arnabchaki\data-science-salaries-2023\versions\1

# Import et analyses exploratoires

On commence par faire des analyses simples sur les données

In [12]:
df = pd.read_csv("data/ds_salaries.csv")
df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000,CA,100,CA,M

In [8]:
df.describe()

         work_year        salary  salary_in_usd  remote_ratio
count  3755.000000  3.755000e+03    3755.000000   3755.000000
mean   2022.373635  1.906956e+05  137570.389880     46.271638
std       0.691448  6.716765e+05   63055.625278     48.589050
min    2020.000000  6.000000e+03    5132.000000      0.000000
25%    2022.000000  1.000000e+05   95000.000000      0.000000
50%    2022.000000  1.380000e+05  135000.000000      0.000000
75%    2023.000000  1.800000e+05  175000.000000    100.000000
max    2023.000000  3.040000e+07  450000.000000    100.000000

In [10]:
print(df.dtypes)

work_year              int64
experience_level      object
employment_type       object
job_title             object
salary                 int64
salary_currency       object
salary_in_usd          int64
employee_residence    object
remote_ratio           int64
company_location      object
company_size          object
dtype: object